# AlignmentStationLabelOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AlignmentStationLabelOptions Properties
AlignmentStationLabelOptions Class See Also
---
The AlignmentStationLabelOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HasLeader | Specifies if the label will have a leader. The default value is true. |
| LeaderEnd | Specifies the leader end point, in model coordinates. The default value is null. When null, the end point will be the same as the Origin point, driven by the Station value. |
| LeaderShoulder | Specifies the leader shoulder point, in model coordinates. The default value is null. When null, the shoulder point will be the same as the Origin point, driven by the Station value. |
| Station | Specifies the station at which the label will be placed, in Revit internal model units (standard Imperial feet). The station determines the location of the label's origin: Origin by setting it to the closest point on the alignment geometry which corresponds to this station. |
| TypeId | Specifies the ElementId of the label type. The default value is InvalidElementId. In this case, the default type id for alignment station labels in the document is used. |

# See Also
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace